HJDSS/STM32-SmartHome-Security/biye/代码/User/esp8266_tls.c
#include "esp8266_tls.h"
#include "esp8266_onenet_mqtt.h"
#include "board_config.h"
#include "usart2.h"
#include "delay.h"
#include "string.h"
#include <stdio.h>
#include <stdlib.h>
#include "log.h"
#include "app_params.h"
#include "gpio.h"
#include "linkage.h"
#include "lock_manager.h"
#include "capture_task.h"

#if USE_FREERTOS
#include "app_rtos.h"
#endif

extern volatile u8 g_pir_debounce_ms;  /* 🟡13: hc_sr501.c 运行时消抖变量 */

extern volatile u8 RELAY_TIME;
extern volatile u32 g_last_cmd_received_tick;
extern volatile u32 g_last_cmd_completed_tick;

#define ESP_DELAY_MS(ms) delay_ms((u16)(ms))

extern void uart1_SendStr(char *SendBuf);
extern void Security_Set_Mode(u8 armed);
#define UART1_SendStr uart1_SendStr

#define WIFI_SSID    BOARD_WIFI_SSID
#define WIFI_PASS    BOARD_WIFI_PASS
#ifndef WIFI_CWJAP_TIMEOUT_MS
#define WIFI_CWJAP_TIMEOUT_MS  20000u
#endif
#ifndef WIFI_CWJAP_RETRY_COUNT
#define WIFI_CWJAP_RETRY_COUNT  2u
#endif
#ifndef ESP_AT_BOOT_DELAY_MS
#define ESP_AT_BOOT_DELAY_MS   1200u
#endif
#ifndef ESP_AT_HANDSHAKE_RETRIES
#define ESP_AT_HANDSHAKE_RETRIES  5u
#endif
#ifndef WIFI_PRECONF_CIFSR_RETRIES
#define WIFI_PRECONF_CIFSR_RETRIES  50u
#endif
#ifndef WIFI_PRECONF_CIFSR_GAP_MS
#define WIFI_PRECONF_CIFSR_GAP_MS   400u
#endif
#ifndef WIFI_PRECONF_CIFSR_POST_OK_MS
#define WIFI_PRECONF_CIFSR_POST_OK_MS  60u
#endif
#ifndef WIFI_MAX_CHANNEL
#define WIFI_MAX_CHANNEL  11u
#endif
#ifndef WIFI_USE_CWLAP_PRECHECK
#define WIFI_USE_CWLAP_PRECHECK  0u
#endif

static u8 cifsr_buf_has_sta_ip(const char *buf)
{
    if(buf == NULL || buf[0] == 0) return 0u;
    if(strstr(buf, "STAIP") != NULL) return 1u;
    if(strstr(buf, "192.") != NULL) return 1u;
    if(strstr(buf, "10.") != NULL) return 1u;
    if(strstr(buf, "172.16.") != NULL || strstr(buf, "172.17.") != NULL
        || strstr(buf, "172.18.") != NULL || strstr(buf, "172.19.") != NULL
        || strstr(buf, "172.2") != NULL || strstr(buf, "172.3") != NULL)
        return 1u;
    return 0u;
}

u8 Ctrl_Led;
u8 Ctrl_Door;
u8 Ctrl_Arm;
u8 ESP8266_Online_Flag;

u8 tls_inited = 0;
volatile u8 g_net_stage = 0;
volatile u8 g_wifi_fail_reason = 0;
volatile u8 g_wifi_substage = 0;
volatile u8 g_wifi_err = 0;
volatile u32 g_net_reconnect_count = 0;
volatile u32 g_net_offline_count = 0;

static char s_payload_snap[512];
static char s_reply_id[64];
static u8 s_is_property_set;
static u8 s_last_ctrl_door = 0u;
static u8 s_last_ctrl_led = 0u;

static u8 WaitSubstr(const char *sub, u16 timeout_ms);
static void ESP8266_Debug_DumpBootInfo(void);
static void Net_LogSimple(const char *msg);
static void Net_MarkOffline(const char *reason);

static void OneNET_Reply_PropertySet(u8 code)
{
    char topic[120];
    char jb[128];

    if(s_reply_id[0] == '\0') return;
    sprintf(topic, "$sys/%s/%s/thing/property/set/reply",
            ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
    sprintf(jb, "{\"id\":\"%s\",\"code\":%u}", s_reply_id, (unsigned)code);
    OneNET_AT_Mqtt_PublishRaw(topic, jb, (u16)strlen(jb));
}

static void OneNET_Process_Remote_Ctrl(void)
{
    if(Ctrl_Door != s_last_ctrl_door)
    {
        if(Ctrl_Door != 0u)
        {
            /* 🟡1: 远程开锁前检查本地安全状态 */
            if(LockManager_IsPwdLocked() || LockManager_IsBruteAlarm())
            {
                Net_LogSimple("[NET] remote unlock denied: locked/brute");
            }
            else
            {
                RELAY = 0;
                RELAY_TIME = APP_LOCK_OPEN_HOLD_TICKS;
                Linkage_OnUnlock(UNLOCK_SRC_REMOTE);
            }
        }
        s_last_ctrl_door = Ctrl_Door;
    }
    if(Ctrl_Led != s_last_ctrl_led)
    {
        if(Ctrl_Led != 0u)
            Light_Relay_On();
        else
            Light_Relay_Off();
        s_last_ctrl_led = Ctrl_Led;
    }
}

static void Net_LogSimple(const char *msg)
{
    if(msg == NULL) return;
    LOG_NET("%s", msg);
}

static void Net_MarkOffline(const char *reason)
{
    if(ESP8266_Online_Flag != 0u)
    {
        g_net_offline_count++;
        LOG_NET("offline");
    }
    ESP8266_Online_Flag = 0u;
    tls_inited = 0u;
    if(reason != NULL)
    {
        LOG_NET("reason: %s", reason);
    }
}

void ESP8266_EN_GPIO_Init(void)
{
#if BOARD_WIFI_USE_NODEMCU
    return;
#else
    GPIO_InitTypeDef gi;
    RCC_APB2PeriphClockCmd(BOARD_ESP8266_EN_CLK, ENABLE);
    GPIO_WriteBit(BOARD_ESP8266_EN_PORT, BOARD_ESP8266_EN_PIN, Bit_SET);
    gi.GPIO_Pin   = BOARD_ESP8266_EN_PIN;
    gi.GPIO_Mode  = GPIO_Mode_Out_PP;
    gi.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(BOARD_ESP8266_EN_PORT, &gi);
    GPIO_WriteBit(BOARD_ESP8266_EN_PORT, BOARD_ESP8266_EN_PIN, Bit_SET);
#endif
}

void ESP8266_RESET(void)
{
#if BOARD_WIFI_USE_NODEMCU
    UART1_SendStr("[OneNET] ESP8266_RESET skipped (EN not MCU controlled)\r\n");
    return;
#else
    u8 i;
    GPIO_WriteBit(BOARD_ESP8266_EN_PORT, BOARD_ESP8266_EN_PIN, Bit_RESET);
    for(i = 0; i < 5; i++) { ESP8266_CooperativeYield(); ESP_DELAY_MS(20); }
    GPIO_WriteBit(BOARD_ESP8266_EN_PORT, BOARD_ESP8266_EN_PIN, Bit_SET);
    for(i = 0; i < 15; i++) { ESP8266_CooperativeYield(); ESP_DELAY_MS(20); }
    UART1_SendStr("[OneNET] ESP8266硬件复位完成\r\n");
#endif
}

static u8 WaitSubstr(const char *sub, u16 timeout_ms)
{
    u16 t = 0;
    if(sub == NULL) return 0;
    while(t < timeout_ms)
    {
        if(strstr(Uart2_Buf, sub) != NULL) return 1;
        ESP8266_CooperativeYield();
        ESP_DELAY_MS(20);
        t += 20;
    }
    return 0;
}

static void ESP8266_Debug_DumpBootInfo(void)
{
#if BOARD_WIFI_DEBUG_BOOTINFO
    CLR_Buf2();
    UART2_SendString("AT+GMR\r\n");
    if(WaitSubstr("OK", 1500))
    {
        UART1_SendStr("[ESP01S] AT+GMR:\r\n");
        UART1_SendStr(Uart2_Buf);
        UART1_SendStr("\r\n");
    }

    CLR_Buf2();
    UART2_SendString("AT+CWMODE?\r\n");
    if(WaitSubstr("OK", 1200))
    {
        UART1_SendStr("[ESP01S] AT+CWMODE?:\r\n");
        UART1_SendStr(Uart2_Buf);
        UART1_SendStr("\r\n");
    }

    CLR_Buf2();
    UART2_SendString("AT+CWSTATE?\r\n");
    if(WaitSubstr("OK", 1200))
    {
        UART1_SendStr("[ESP01S] AT+CWSTATE?:\r\n");
        UART1_SendStr(Uart2_Buf);
        UART1_SendStr("\r\n");
    }
#endif
}

