HJDSS/STM32-SmartHome-Security/biye/代码/User/esp8266_tls.c
static u8 WaitOkOrError(u16 timeout_ms)
{
    u16 t = 0;
    while(t < timeout_ms)
    {
        if(strstr(Uart2_Buf, "OK") != NULL) return 1u;
        if(strstr(Uart2_Buf, "ERROR") != NULL) return 0u;
        if(strstr(Uart2_Buf, "FAIL") != NULL) return 0u;
        if(strstr(Uart2_Buf, "busy") != NULL) return 0u;
        ESP8266_CooperativeYield();
        ESP_DELAY_MS(20);
        t += 20;
    }
    return 0u;
}

static u8 WaitCwjapOkOrFail(u16 timeout_ms)
{
    u16 t = 0;
    while(t < timeout_ms)
    {
        if(strstr(Uart2_Buf, "OK") != NULL) return 1u;
        if(strstr(Uart2_Buf, "FAIL") != NULL) return 0u;
        if(strstr(Uart2_Buf, "ERROR") != NULL) return 0u;
        if(strstr(Uart2_Buf, "No AP") != NULL) return 0u;
        if(strstr(Uart2_Buf, "WIFI DISCONNECT") != NULL) return 0u;
        ESP8266_CooperativeYield();
        ESP_DELAY_MS(20);
        t += 20;
    }
    return 0u;
}

static u8 ESP8266_WiFi_Join(void)
{
#if BOARD_WIFI_PRECONFIGURED
    {
        u8 n;
        g_wifi_substage = 20u;
        if(!ESP8266_AT_SendWait("AT+CWMODE=1","OK",3000)) return 0;
        g_wifi_substage = 22u;
        for(n = 0u; n < (u8)WIFI_PRECONF_CIFSR_RETRIES; n++)
        {
            CLR_Buf2();
            UART2_SendString("AT+CIFSR\r\n");
            if(WaitSubstr("OK", 4000))
            {
                ESP_DELAY_MS((u16)WIFI_PRECONF_CIFSR_POST_OK_MS);
                if(strstr(Uart2_Buf, "+CIFSR") != NULL && cifsr_buf_has_sta_ip(Uart2_Buf))
                    return 1;
            }
            ESP8266_CooperativeYield();
            ESP_DELAY_MS((u16)WIFI_PRECONF_CIFSR_GAP_MS);
        }
        UART1_SendStr("[WiFi] preconf: join fail, last Uart2_Buf:\r\n");
        UART1_SendStr(Uart2_Buf);
        UART1_SendStr("\r\n");
    }
    return 0;
#else
    char cmd[128];
    u8 n;
    g_wifi_substage = 20u;
    CLR_Buf2();
    UART2_SendString("AT+CWMODE?\r\n");
    if(!(WaitSubstr("OK", 2500) && (strstr(Uart2_Buf, "+CWMODE:1") != NULL || strstr(Uart2_Buf, "+CWMODE_CUR:1") != NULL)))
    {
        CLR_Buf2();
        UART2_SendString("AT+CWMODE=1\r\n");
        if(!WaitOkOrError(3000))
        {
            CLR_Buf2();
            UART2_SendString("AT+CWMODE_CUR=1\r\n");
            if(!WaitOkOrError(3000))
            {
                g_wifi_err = 4u;
                UART1_SendStr("[WiFi] CWMODE set fail, rsp:\r\n");
                UART1_SendStr(Uart2_Buf);
                UART1_SendStr("\r\n");
                return 0;
            }
        }
    }
    g_wifi_substage = 21u;
    ESP8266_AT_SendWait("AT+CWQAP", "OK", 2000);
    for(n = 0u; n < (u8)WIFI_CWJAP_RETRY_COUNT; n++)
    {
        CLR_Buf2();
        sprintf(cmd,"AT+CWJAP=\"%s\",\"%s\"",WIFI_SSID,WIFI_PASS);
        UART2_SendString(cmd);
        UART2_SendString("\r\n");
        if(WaitCwjapOkOrFail((u16)WIFI_CWJAP_TIMEOUT_MS))
        {
            g_wifi_substage = 22u;
            return 1;
        }

        CLR_Buf2();
        sprintf(cmd,"AT+CWJAP_CUR=\"%s\",\"%s\"",WIFI_SSID,WIFI_PASS);
        UART2_SendString(cmd);
        UART2_SendString("\r\n");
        if(WaitCwjapOkOrFail((u16)WIFI_CWJAP_TIMEOUT_MS))
        {
            g_wifi_substage = 22u;
            return 1;
        }
        ESP8266_CooperativeYield();
        ESP_DELAY_MS(200);
    }
    g_wifi_err = 3u;
    UART1_SendStr("[WiFi] CWJAP fail, rsp:\r\n");
    UART1_SendStr(Uart2_Buf);
    UART1_SendStr("\r\n");
    return 0;
#endif
}

u8 ESP8266_AT_SendWait(char *cmd,char *ack,u16 timeout_ms)
{
    u16 t=0;
    if(cmd==NULL) return 0;
    CLR_Buf2();
    UART2_SendString(cmd);
    UART2_SendString("\r\n");

    while(t < timeout_ms)
    {
        if(ack==NULL) return 1;
        if(strstr(Uart2_Buf,ack)!=NULL) return 1;
        ESP8266_CooperativeYield();
        ESP_DELAY_MS(20);
        t += 20;
    }
    return 0;
}

typedef struct
{
    u8 active;
    u32 t0;
    u16 tmo_ms;
    char *ack;
} at_nb_t;
static at_nb_t g_at_nb;

typedef struct
{
    u8 active;
    u32 t0;
    u16 tmo_ms;
    const char *sub;
} wait_nb_t;
static wait_nb_t g_wait_nb;

typedef struct
{
    u8 active;
    u32 t0;
    u16 tmo_ms;
    const char *a;
    const char *b;
} wait2_nb_t;
static wait2_nb_t g_wait2_nb;

u8 ESP8266_AT_Nb_Begin(char *cmd, char *ack, u16 timeout_ms)
{
    if(cmd == NULL)
        return 0;
    CLR_Buf2();
    UART2_SendString(cmd);
    UART2_SendString("\r\n");
    g_at_nb.t0 = Bare_GetTickMs();
    g_at_nb.tmo_ms = timeout_ms;
    g_at_nb.ack = ack;
    g_at_nb.active = 1;
    return 1;
}

u8 ESP8266_AT_Nb_Poll(void)
{
    if(!g_at_nb.active)
        return 2;
    if(g_at_nb.ack != NULL && strstr(Uart2_Buf, g_at_nb.ack) != NULL)
    {
        g_at_nb.active = 0;
        return 1;
    }
    if((u32)(Bare_GetTickMs() - g_at_nb.t0) >= g_at_nb.tmo_ms)
    {
        g_at_nb.active = 0;
        return 2;
    }
    ESP8266_CooperativeYield();
    return 0;
}

void ESP8266_WaitStr_Nb_Begin(const char *sub, u16 timeout_ms)
{
    g_wait_nb.active = 1;
    g_wait_nb.t0 = Bare_GetTickMs();
    g_wait_nb.tmo_ms = timeout_ms;
    g_wait_nb.sub = sub;
}

u8 ESP8266_WaitStr_Nb_Poll(void)
{
    if(!g_wait_nb.active)
        return 2;
    if(g_wait_nb.sub != NULL && strstr(Uart2_Buf, g_wait_nb.sub) != NULL)
    {
        g_wait_nb.active = 0;
        return 1;
    }
    if((u32)(Bare_GetTickMs() - g_wait_nb.t0) >= g_wait_nb.tmo_ms)
    {
        g_wait_nb.active = 0;
        return 2;
    }
    ESP8266_CooperativeYield();
    return 0;
}

void ESP8266_WaitAny2_Nb_Begin(const char *a, const char *b, u16 timeout_ms)
{
    g_wait2_nb.active = 1;
    g_wait2_nb.t0 = Bare_GetTickMs();
    g_wait2_nb.tmo_ms = timeout_ms;
    g_wait2_nb.a = a;
    g_wait2_nb.b = b;
}

u8 ESP8266_WaitAny2_Nb_Poll(void)
{
    if(!g_wait2_nb.active)
        return 3;
    if(g_wait2_nb.a != NULL && strstr(Uart2_Buf, g_wait2_nb.a) != NULL)
    {
        g_wait2_nb.active = 0;
        return 1;
    }
    if(g_wait2_nb.b != NULL && strstr(Uart2_Buf, g_wait2_nb.b) != NULL)
    {
        g_wait2_nb.active = 0;
        return 2;
    }
    if(strstr(Uart2_Buf, "ERROR") != NULL)
    {
        g_wait2_nb.active = 0;
        return 3;
    }
    if((u32)(Bare_GetTickMs() - g_wait2_nb.t0) >= g_wait2_nb.tmo_ms)
    {
        g_wait2_nb.active = 0;
        return 3;
    }
    ESP8266_CooperativeYield();
    return 0;
}

u8 ESP8266_Connect_WiFi(void)
{
    if(!ESP8266_WiFi_Join())
    {
        g_wifi_fail_reason = 2u;
        UART1_SendStr("[WiFi] CWMODE or CWJAP fail\r\n");
        UART1_SendStr("[OneNET] WiFi连接失败，初始化终止\r\n");
        return 0;
    }
    g_wifi_fail_reason = 0u;
    g_wifi_err = 0u;
#if BOARD_WIFI_PRECONFIGURED
    UART1_SendStr("[WiFi] preconf: STA IP OK (CIFSR in join)\r\n");
    return 1;
#else
    CLR_Buf2();
    UART2_SendString("AT+CIFSR");
    UART2_SendString("\r\n");
    if(WaitSubstr("OK",3000))
    {
        UART1_SendStr("WiFi连接成功，IP信息:\r\n");
        UART1_SendStr(Uart2_Buf);
        UART1_SendStr("\r\n");
    }
    else
        UART1_SendStr("WiFi连接成功（CIFSR超时，未读到IP）\r\n");
    return 1;
#endif
}

