HJDSS/STM32-SmartHome-Security/biye/代码/User/esp8266_tls.c
u8 ESP8266_TLS_Init(void)
{
    ESP8266_Online_Flag = 0;
    g_wifi_fail_reason = 0u;
    g_wifi_substage = 0u;
    g_wifi_err = 0u;
    ESP_DELAY_MS((u16)ESP_AT_BOOT_DELAY_MS);
    g_net_stage = 1;
    g_wifi_substage = 1u;
    {
        u8 n;
        for(n = 0u; n < (u8)ESP_AT_HANDSHAKE_RETRIES; n++)
        {
            if(ESP8266_AT_SendWait("AT","OK",1000))
                break;
            ESP8266_CooperativeYield();
            ESP_DELAY_MS(120);
        }
        if(n >= (u8)ESP_AT_HANDSHAKE_RETRIES)
        {
            g_wifi_fail_reason = 1u;
            UART1_SendStr("[OneNET] 模块AT握手失败，初始化终止\r\n");
            UART1_SendStr("[OneNET] last rsp:\r\n");
            UART1_SendStr(Uart2_Buf);
            UART1_SendStr("\r\n");
            return 0;
        }
    }
    ESP8266_AT_SendWait("ATE0","OK",1000);
    ESP8266_AT_SendWait("AT+CIPMUX=0","OK",1000);
    ESP8266_Debug_DumpBootInfo();
    g_net_stage = 2;
    g_wifi_substage = 20u;
    if(!ESP8266_Connect_WiFi()) return 0;
    g_wifi_substage = 23u;
    return 1;
}

u8 ESP8266_OneNET_Full_Init(void)
{
    ESP8266_OneNET_InitFsm_Reset();
    while(!tls_inited)
        ESP8266_OneNET_InitFsm_Poll();
    return 1;
}

static u16 s_onenet_mst;
static u32 s_onenet_t0;
static u32 s_backoff_ms = APP_NET_BACKOFF_INIT_MS;
static u8 s_tls_hs_n;

void ESP8266_OneNET_InitFsm_Reset(void)
{
    s_onenet_mst = 0;
    s_tls_hs_n = 0;
    s_backoff_ms = APP_NET_BACKOFF_INIT_MS;
    tls_inited = 0;
    g_at_nb.active = 0;
    g_wait_nb.active = 0;
    g_wait2_nb.active = 0;
    ESP8266_OneNET_MqttFsm_Reset();
}

void ESP8266_OneNET_InitFsm_Poll(void)
{
    u32 now = Bare_GetTickMs();
    u8 pr;

#if !ONENET_MQTT_ENABLE
    tls_inited = 1;
    g_net_stage = 4;
    (void)now;
    return;
#endif
    if(tls_inited)
        return;

    switch(s_onenet_mst)
    {
    case 0:
        s_onenet_t0 = now;
        s_onenet_mst = 1;
        return;
    case 1:
        if((u32)(now - s_onenet_t0) < 200u)
            return;
        s_onenet_t0 = now;
        s_onenet_mst = 2;
        return;
    case 2:
        if((u32)(now - s_onenet_t0) < s_backoff_ms)
            return;
        g_net_reconnect_count++;
        Net_LogSimple("[NET] reconnect begin");
        ESP8266_Online_Flag = 0;
        g_wifi_fail_reason = 0u;
        g_wifi_substage = 0u;
        g_wifi_err = 0u;
        g_net_stage = 1;
        g_wifi_substage = 1u;
        s_tls_hs_n = 0;
        ESP8266_AT_Nb_Begin("AT", "OK", 1000);
        s_onenet_mst = 11;
        return;
    case 11:
        pr = ESP8266_AT_Nb_Poll();
        if(pr == 0)
            return;
        if(pr == 1)
        {
            s_onenet_mst = 20;
            return;
        }
        s_tls_hs_n++;
        if(s_tls_hs_n >= (u8)ESP_AT_HANDSHAKE_RETRIES)
        {
            g_wifi_fail_reason = 1u;
            Net_MarkOffline("AT handshake failed");
            UART1_SendStr("[OneNET] 模块AT握手失败(FSM)\r\n");
            s_backoff_ms = s_backoff_ms * 2;
            if (s_backoff_ms > APP_NET_BACKOFF_MAX_MS) s_backoff_ms = APP_NET_BACKOFF_MAX_MS;
            ESP8266_RESET();
            s_onenet_mst = 0;
            s_onenet_t0 = now;
            return;
        }
        s_onenet_t0 = now;
        s_onenet_mst = 12;
        return;
    case 12:
        if((u32)(now - s_onenet_t0) < 120u)
            return;
        ESP8266_AT_Nb_Begin("AT", "OK", 1000);
        s_onenet_mst = 11;
        return;
    case 20:
        ESP8266_AT_Nb_Begin("ATE0", "OK", 1000);
        s_onenet_mst = 21;
        return;
    case 21:
        pr = ESP8266_AT_Nb_Poll();
        if(pr == 0)
            return;
        if(pr != 1)
        {
            s_backoff_ms = s_backoff_ms * 2;
            if (s_backoff_ms > APP_NET_BACKOFF_MAX_MS) s_backoff_ms = APP_NET_BACKOFF_MAX_MS;
            ESP8266_RESET();
            s_onenet_mst = 0;
            s_onenet_t0 = now;
            return;
        }
        s_onenet_mst = 30;
        return;
    case 30:
        ESP8266_AT_Nb_Begin("AT+CIPMUX=0", "OK", 1000);
        s_onenet_mst = 31;
        return;
    case 31:
        pr = ESP8266_AT_Nb_Poll();
        if(pr == 0)
            return;
        if(pr != 1)
        {
            s_backoff_ms = s_backoff_ms * 2;
            if (s_backoff_ms > APP_NET_BACKOFF_MAX_MS) s_backoff_ms = APP_NET_BACKOFF_MAX_MS;
            ESP8266_RESET();
            s_onenet_mst = 0;
            s_onenet_t0 = now;
            return;
        }
        g_net_stage = 2;
        g_wifi_substage = 20u;
        s_onenet_mst = 40;
        return;
    case 40:
        if(!ESP8266_Connect_WiFi())
        {
            g_wifi_fail_reason = 2u;
            Net_MarkOffline("WiFi join failed");
            UART1_SendStr("[OneNET] WiFi连接失败(FSM)\r\n");
            s_backoff_ms = s_backoff_ms * 2;
            if (s_backoff_ms > APP_NET_BACKOFF_MAX_MS) s_backoff_ms = APP_NET_BACKOFF_MAX_MS;
            ESP8266_RESET();
            s_onenet_mst = 0;
            s_onenet_t0 = now;
            return;
        }
        g_net_stage = 3;
        ESP8266_OneNET_MqttFsm_Reset();
        s_onenet_mst = 50;
        return;
    case 50:
    {
        u8 mr = ESP8266_OneNET_MqttFsm_Poll();
        if(mr == 0)
            return;
        if(mr == 2)
        {
            g_wifi_fail_reason = 3u;
            Net_MarkOffline("MQTT connect failed");
            UART1_SendStr("[OneNET] MQTT连接失败(FSM)\r\n");
            s_backoff_ms = s_backoff_ms * 2;
            if (s_backoff_ms > APP_NET_BACKOFF_MAX_MS) s_backoff_ms = APP_NET_BACKOFF_MAX_MS;
            ESP8266_RESET();
            ESP8266_OneNET_MqttFsm_Reset();
            s_onenet_mst = 0;
            s_onenet_t0 = now;
            return;
        }
        tls_inited = 1;
        s_backoff_ms = APP_NET_BACKOFF_INIT_MS;
        g_wifi_fail_reason = 0u;
        g_net_stage = 4;
        Net_LogSimple("[NET] reconnect success");
        UART1_SendStr("[OneNET] WiFi与MQTT鉴权成功(FSM)\r\n");
        s_onenet_mst = 100;
        return;
    }
    case 100:
    default:
        return;
    }
}

void OneNET_Publish_Data(u8 temp, u8 humi, u16 gas, u8 door, u8 arm, u8 alarm, u8 led)
{
    static char topic[120];
    static char jb[384];
    static unsigned id_n = 1;

