HJDSS/STM32-SmartHome-Security/biye/代码/User/esp8266_tls.c
#if !ONENET_MQTT_ENABLE
    (void)temp; (void)humi; (void)gas; (void)door; (void)arm; (void)alarm; (void)led;
    return;
#else
    if(ESP8266_Online_Flag == 0) return;

    sprintf(topic, "$sys/%s/%s/thing/property/post",
            ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
    sprintf(jb,
            "{\"id\":\"%u\",\"version\":\"1.0\",\"params\":{"
            "\"temp\":{\"value\":%.1f},\"hum\":{\"value\":%.1f},\"gas\":{\"value\":%.1f},"
            "\"door\":{\"value\":%s},\"arm\":{\"value\":%s},\"alarm\":{\"value\":%s},\"led\":{\"value\":%s}"
            "}}",
            id_n++,
            (float)temp, (float)humi, (float)gas,
            door ? "true" : "false",
            arm ? "true" : "false",
            alarm ? "true" : "false",
            led ? "true" : "false");

    OneNET_AT_Mqtt_PublishRaw(topic, jb, (u16)strlen(jb));
#endif
}

/* 🟡10: 异常告警即时推送 — 独立于5秒周期上报，事件驱动 */
void OneNET_Publish_Alarm(const char *alarm_type)
{
#if ONENET_MQTT_ENABLE
    char topic[120];
    char payload[256];
    u32 tick;
    if (alarm_type == NULL) return;
    if (ESP8266_Online_Flag == 0u) return;
    tick = (u32)Bare_GetTickMs();
    sprintf(topic, "$sys/%s/%s/thing/property/post",
            ONENET_PRODUCT_ID, ONENET_DEVICE_NAME);
    sprintf(payload,
            "{\"id\":\"alarm%lu\",\"version\":\"1.0\",\"params\":{\"alarm_event\":{\"value\":\"%s\"},\"alarm_ts\":{\"value\":%lu}}}",
            (unsigned long)tick, alarm_type, (unsigned long)tick);
    OneNET_AT_Mqtt_PublishRaw(topic, payload, (u16)strlen(payload));
    LOG_NET("alarm push: %s", alarm_type);
#else
    (void)alarm_type;
#endif
}

u8 OneNET_PropertySetPending(void)
{
    return s_is_property_set;
}

const char *OneNET_PropertySetPayload(void)
{
    return s_payload_snap;
}

const char *OneNET_PropertySetReplyId(void)
{
    return s_reply_id;
}

void OneNET_PropertySetClear(void)
{
    s_is_property_set = 0u;
}

void OneNET_Parse_Cmd(void)
{
#if !ONENET_MQTT_ENABLE
    return;
#else
    char *p;
    unsigned v;
    u8 cmd_arm = 0u;
    u8 cmd_arm_found = 0u;
    const char *scan = Uart2_Buf;
    const char *param_src;
    unsigned cmd_id = 0u;
    unsigned cmd_ts = 0u;
    /* 🟡3: 环形缓冲区去重替代单槽, APP_CMD_DEDUP_RING=16, APP_CMD_STALE_MS=60s */
    static unsigned s_dedup_id[APP_CMD_DEDUP_RING];
    static unsigned s_dedup_ts[APP_CMD_DEDUP_RING];
    static u8 s_dedup_head = 0u;
    static u8 s_dedup_count = 0u;
    unsigned i;

    if(Uart2_Buf[0] == 0) return;

    /* 关USART3中断 → 保护Uart2_Buf在解析期间不被ISR修改 */
    USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);

    p = strstr(Uart2_Buf, "+MQTTSUBRECV:");
    if(p != NULL)
        scan = p;

    p = strstr((char *)scan, "\"cmdId\"");
    if(p != NULL)
    {
        if(sscanf(p, "\"cmdId\":%u", &cmd_id) == 1)
        {
            char *pt = strstr((char *)scan, "\"ts\"");
            if(pt != NULL) (void)sscanf(pt, "\"ts\":%u", &cmd_ts);

            /* 🟡3: 环冲去重 — 扫描已有条目，匹配则拒绝 */
            {
                unsigned now_ts = (unsigned)Bare_GetTickMs();
                u8 j;
                for (j = 0u; j < s_dedup_count; j++)
                {
                    u8 idx = (u8)((s_dedup_head + APP_CMD_DEDUP_RING - s_dedup_count + j) % APP_CMD_DEDUP_RING);
                    if ((u32)(now_ts - s_dedup_ts[idx]) > (u32)APP_CMD_STALE_MS)
                        continue; /* 过期条目跳过 */
                    if (s_dedup_id[idx] == cmd_id && s_dedup_ts[idx] == cmd_ts)
                    {
                        Net_LogSimple("[NET] dedup duplicate cmd");
                        USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
                        return;
                    }
                }
                /* 写入环冲 */
                s_dedup_id[s_dedup_head] = cmd_id;
                s_dedup_ts[s_dedup_head] = (unsigned)Bare_GetTickMs();
                s_dedup_head = (u8)((s_dedup_head + 1u) % APP_CMD_DEDUP_RING);
                if (s_dedup_count < APP_CMD_DEDUP_RING)
                    s_dedup_count++;
            }
        }
    }

    g_last_cmd_received_tick = Bare_GetTickMs();

    s_is_property_set = 0u;
    s_reply_id[0] = '\0';
    s_payload_snap[0] = '\0';

    p = strstr((char *)scan, "property/set");
    if(p != NULL)
    {
        char *json_start = strchr(p, '{');
        if(json_start != NULL)
        {
            for(i = 0u; i < (unsigned)(sizeof(s_payload_snap) - 1u) && json_start[i] != 0; i++)
                s_payload_snap[i] = json_start[i];
            s_payload_snap[i] = '\0';

            p = strstr(s_payload_snap, "\"id\":\"");
            if(p != NULL)
            {
                char *qs = p + 6;
                char *qe = strchr(qs, '"');
                if(qe != NULL && qe > qs
                    && (size_t)(qe - qs) < sizeof(s_reply_id))
                {
                    (void)memcpy(s_reply_id, qs, (size_t)(qe - qs));
                    s_reply_id[(size_t)(qe - qs)] = '\0';
                    s_is_property_set = 1u;
                }
            }
            else
            {
                char *qe;
                p = strstr(s_payload_snap, "\"id\":");
                if(p != NULL)
                {
                    char *qs = p + 5;
                    char *endp = NULL;
                    unsigned long n;

                    if(*qs == '"')
                    {
                        qs++;
                        qe = strchr(qs, '"');
                        if(qe != NULL && qe > qs
                            && (size_t)(qe - qs) < sizeof(s_reply_id))
                        {
                            (void)memcpy(s_reply_id, qs, (size_t)(qe - qs));
                            s_reply_id[(size_t)(qe - qs)] = '\0';
                            s_is_property_set = 1u;
                        }
                    }
                    else
                    {
                        n = strtoul(qs, &endp, 10);
                        if(endp != qs)
                        {
                            (void)snprintf(s_reply_id, sizeof(s_reply_id), "%lu", n);
                            s_is_property_set = 1u;
                        }
                    }
                }
            }
        }
    }

    param_src = (s_payload_snap[0] != 0) ? (const char *)s_payload_snap : scan;

    UART1_SendStr("收到云端数据:\r\n");
    UART1_SendStr(Uart2_Buf);
    UART1_SendStr("\r\n");

    if((p = strstr((char *)param_src, "\"led\"")) != NULL)
    {
        if(sscanf(p, "\"led\":{\"value\":%u", &v) == 1)
            Ctrl_Led = (u8)v;
        else if(sscanf(p, "\"led\":%u", &v) == 1)
            Ctrl_Led = (u8)v;
        else if(strstr(p, "\"led\":{\"value\":\"true\"") != NULL) Ctrl_Led = 1;
        else if(strstr(p, "\"led\":{\"value\":\"false\"") != NULL) Ctrl_Led = 0;
        else if(strstr(p, "\"led\":{\"value\":true") != NULL) Ctrl_Led = 1;
        else if(strstr(p, "\"led\":{\"value\":false") != NULL) Ctrl_Led = 0;
    }
    if((p = strstr((char *)param_src, "ctrl_door")) != NULL)
    {
        if(sscanf(p, "ctrl_door\":{\"value\":%u", &v) == 1)
            Ctrl_Door = (u8)v;
        else if(sscanf(p, "ctrl_door\":%u", &v) == 1)
            Ctrl_Door = (u8)v;
        else if(strstr(p, "ctrl_door\":{\"value\":\"true\"") != NULL) Ctrl_Door = 1;
        else if(strstr(p, "ctrl_door\":{\"value\":\"false\"") != NULL) Ctrl_Door = 0;
        else if(strstr(p, "ctrl_door\":{\"value\":true") != NULL) Ctrl_Door = 1;
        else if(strstr(p, "ctrl_door\":{\"value\":false") != NULL) Ctrl_Door = 0;
        else if(strstr(p, "true") != NULL) Ctrl_Door = 1;
        else if(strstr(p, "false") != NULL) Ctrl_Door = 0;
    }
    OneNET_Process_Remote_Ctrl();

